//
//
//
const kanbanNpcdialog_1 = ["こんにちは．",
                        "看板の文字が消されて読めなくなっていて人々が道に迷っています．",
                        "文字を復元してみんなが読めるようにしてくれますか？"]
const kanbanNpcdialog_yes = [
  "5分以内に復元しないと文字がまた消されちゃうから注意して！"
];

const kanbanNpcdialog_no = [
  "解決できそうならまた来てね！"
];

const kanbanNpcdialog_lose = ["あきらめないで！"]
const kanbanNpcdialog_clear = ["ありがとうございます！",
                                "お礼に1000コインをあげる！",
                                "他の困っている人も助けてあげてください！"
]///
//
//
//くさNPCFORを持っていないとき
const kusaNpcdialog_noFor = [
    "こんにちは．",
    "あそこにいるおばあさんが何年もずっと草むしりをしています．",
    "機械を作ってあげておばあさんの負担を減らしてくれませんか？",
    "あら，あなたアイテム【FOR】を持ってないみたいね．",
    "道具屋でもらえるみたいだからもらってきて！",
    "その機械には【FOR】が必要なの．"
]

//
//草FORを持っているとき
const kusaNpcdialog_1 = [
    "こんにちは．",
    "あそこにいるおばあさんが何年もずっと草むしりをしています．",
    "機械を作ってあげておばあさんの負担を減らしてくれませんか？"
]

const kusaNpcdialog_yes = [
  "5分以内に作らないと機械が壊れてしまうから注意して！"
];

const kusaNpcdialog_no = [
  "解決できそうならまた来てね！"
];

const kusaNpcdialog_lose = ["あきらめないで！"]

const kusaNpcdialog_clear = ["ありがとうございます！",
                                "他の困っている人も助けてあげてください！"
]

///
//
//
//おばあさん
const kusaBabadialog_lose = ["あら、こんにちは。",
                            " わたしゃもう何年もこの草むしりを続けてるんだけどねぇ…年寄りにはちと堪えるよ。",
                            " 昔は手で全部やってたけど、今は草の方が元気でねぇ…",
                            " あんた、もし機械なんか作れるなら、ちょっと手を貸してくれんかい？",
                            "ちょいとそこの草の妖精が草刈り機の作り方を知ってるらしいわ！！"]
const kusaBabadialog_clear = [
  "草がスイスイ抜けていくよ、まるで魔法みたいだねぇ。",
  " わたしの手も腰も、もう少し長持ちしそうだよ。ほんとにありがとうね。",
  " これはお礼のコインだよ。他にも困ってる人がいたら、助けてあげておくれ"
]

const kusaBabadialog_clear2 = ["本当に助かってるわ！ありがとう"]


//
//橋NPCの会話データ
//
const hasiNpcdialog_noIf = [
  "こんにちは。",
  "向こうの島に渡りたいんだけど、橋が壊れてて渡れないんだ…",
  "修復には“条件分岐”が必要なんだけど、どうやら君はまだそれを使えないみたいだね。",
  "道具屋に行けば“if文”を渡してくれるはずだよ！",
  "あきらめずに、まずは道具屋を訪ねてみて！"
];
const hasiNpcdialog_1 = [
    "こんにちは．",
    "向こうの島に渡りたいんだけど，橋が壊れてていけなくなっているんだ．",
    "橋を修復して渡れるようにしてくれないか？"
]

const hasiNpcdialog_yes = [
  "5分以内に修復しないとまた壊れてしまうから注意して！"
];

const hasiNpcdialog_no = [
  "解決できそうならまた来てね！"
];

const hasiNpcdialog_lose = ["道具屋へ行けばお助けアイテムがあるかも！あきらめないで！"]

const hasiNpcdialog_clear = [
    "ありがとうございます！お礼に5000コインをあげる！",
    "世界が混乱に陥ってから誰も向こうの島に行くことができず，",
    "苦しい生活を送っていたので助かりました！",
    "どうやらその島に今までの混乱を起こした首謀者がいるみたい．",
    "やっつけてこの世界の人々を安心させてください！"
]
const hasiNpcdialog_end = ["どうか気を付けて．．"]
//
//
//
const BOSSdialog_1 = [
  "よくぞここまで来たな。",
  "だが、この世界を混乱に陥れたのは、ただの気まぐれではない。",
  "私を倒すには、今まで培ったすべてのプログラム知識を使いこなす必要がある。",
  "さあ、挑むがいい。君の“コード”が世界を救えるか試してみよう。"
];


const BOSSdialog_yes = [
  "制限時間は5分.その間に私の仕掛けた複合問題を解いてみせろ。",
  "失敗すれば、この世界は永遠にバグに飲み込まれるだろう。"
];


const BOSSdialog_no = [
  "逃げるか…賢い選択かもしれんな。",
  "だが、いつかはこの世界の混乱と向き合う時が来る。"
];


const BOSSdialog_lose = [
  "やはり君では無理だったか。",
  "この世界は、私の手の中で永遠にループし続けるだろう…"
];


const BOSSdialog_clear = [
  "まさか…ここまでプログラミングができる者が現れるとは…！",
  "楽な生活もここまでか…",
  "隠し持っていた宝箱を見つけたようだな。",
  "それが、この世界の混乱の元凶だった財宝だ。",
  "さあ、宝箱を開いて、世界の平和を取り戻すがいい。"
];
