//
//
//
const kanbanNpcdialog_1 = ["こんにちは．",
                        "看板の文字が消されて読めなくなっていて人々が道に迷っています．",
                        "文字を復元してみんなが読めるようにしてくれますか？"]
const kanbanNpcdialog_yes = [
  "5分以内に復元しないと文字がまた消されちゃうから注意して！"
];

const kanbanNpcdialog_no = [
  "解決できそうならまた来てね！"
];

const kanbanNpcdialog_lose = ["あきらめないで！"]
const kanbanNpcdialog_clear = ["ありがとうございます！",
                                "お礼に1000コインをあげる！",
                                "他の困っている人も助けてあげてください！"
]///
//
//
//くさNPCFORを持っていないとき
const kusaNpcdialog_noFor = [
    "こんにちは．",
    "あそこにいるおばあさんが何年もずっと草むしりをしています．",
    "機械を作ってあげておばあさんの負担を減らしてくれませんか？",
    "あら，あなたアイテム【FOR】を持ってないみたいね．",
    "道具屋でもらえるみたいだからもらってきて！",
    "その機械には【FOR】が必要なの．"
]

//
//草FORを持っているとき
const kusaNpcdialog_1 = [
    "こんにちは．",
    "あそこにいるおばあさんが何年もずっと草むしりをしています．",
    "機械を作ってあげておばあさんの負担を減らしてくれませんか？"
]

const kusaNpcdialog_yes = [
  "5分以内に作らないと機械が壊れてしまうから注意して！"
];

const kusaNpcdialog_no = [
  "解決できそうならまた来てね！"
];

const kusaNpcdialog_lose = ["あきらめないで！"]

const kusaNpcdialog_clear = ["ありがとうございます！",
                                "他の困っている人も助けてあげてください！"
]///
//
//
//おばあさん
const kusaBabadialog_lose = ["あら、こんにちは。",
                            " わたしゃもう何年もこの草むしりを続けてるんだけどねぇ…年寄りにはちと堪えるよ。",
                            " 昔は手で全部やってたけど、今は草の方が元気でねぇ…",
                            " あんた、もし機械なんか作れるなら、ちょっと手を貸してくれんかい？",
                            "ちょいとそこの草の妖精が草刈り機の作り方を知ってるらしいわ！！"]
const kusaBabadialog_clear = [
  "草がスイスイ抜けていくよ、まるで魔法みたいだねぇ。",
  " わたしの手も腰も、もう少し長持ちしそうだよ。ほんとにありがとうね。",
  " これはお礼のコインだよ。他にも困ってる人がいたら、助けてあげておくれ"
]

const kusaBabadialog_clear2 = ["本当に助かってるわ！ありがとう"]